export interface Position {
  title: string;
  period: string;
}

export const positions: Position[] = [
  { title: "عضو مجلس الشعب المصري عن باب الشعرية", period: "1995 - 2005" },
  { title: "رئيس حزب الغد", period: "2004 - 2011" },
  { title: "رئيس حزب غد الثورة", period: "2011 - الآن" },
  { title: "نائب رئيس المجلس العربي للديمقراطية", period: "منذ 2014" },
  { title: "رئيس اتحاد القوى الوطنية المصرية", period: "منذ أكتوبر 2021" },
  { title: "عضو مؤسس في التحالف الديمقراطي الأفريقي", period: "فبراير 2026" },
  { title: "عضو مجلس أمناء المنظمة المصرية لحقوق الإنسان", period: "" },
  { title: "مؤسس ورئيس جمعية نور الخيرية", period: "" },
  { title: "مدير تحرير إقليمي (الوفد، الحياة، الدولية، المدينة، الفجر الجديد)", period: "" },
  { title: "مراسل سابق للإذاعة الفرنسية في القاهرة", period: "" },
  { title: "حائز على جائزة أحسن أداء برلماني", period: "" }
];
